; domain
(define (domain wreath-making)
  (:requirements :strips :typing)
  (:types
    hanger pliers paper_square wreath table)

  (:predicates
    ;;
    (shape-straight ?h - hanger)                ;
    (shape-circle ?h - hanger)                 ;
    (crumpled ?p - paper_square)               ;
    (threaded ?h - hanger ?p - paper_square)   ;
    (squares-pushed-away ?h - hanger)          ;
    (twisted-ends ?h - hanger)                 ;
    (squares-scrunched ?p - paper_square)      ;
    (completed ?w - wreath)                    ;
  )

  ;;   1：
  (:action untwist-and-shape-hanger
    :parameters (?h - hanger ?p - pliers)
    :precondition (shape-straight ?h)
    :effect (and
              (shape-circle ?h)
              (not (shape-straight ?h))
            )
  )

  ;;   2：
  (:action crumple-and-thread-paper
    :parameters (?p - paper_square ?h - hanger)
    :precondition (and
                    (shape-circle ?h)
                    (not (crumpled ?p))
                    (not (threaded ?h ?p))
                  )
    :effect (and
              (crumpled ?p)
              (threaded ?h ?p)
            )
  )

  ;;   3：
  (:action push-squares-and-twist-ends
    :parameters (?h - hanger ?p - pliers)
    :precondition (and
                    (shape-circle ?h)
                    (threaded ?h paper1)
                    (threaded ?h paper2)
                    (threaded ?h paper3)
                  )
    :effect (and
              (squares-pushed-away ?h)
              (twisted-ends ?h)
            )
  )

  ;;   4：
  (:action slide-and-scrunch-squares
    :parameters (?p - paper_square ?h - hanger)
    :precondition (and
                    (squares-pushed-away ?h)
                    (threaded ?h ?p)
                    (crumpled ?p)
                  )
    :effect (squares-scrunched ?p)
  )

  ;;   5：
  (:action finish-wreath
    :parameters (?w - wreath ?h - hanger)
    :precondition (and
                    (twisted-ends ?h)
                    (squares-scrunched paper1)
                    (squares-scrunched paper2)
                    (squares-scrunched paper3)
                  )
    :effect (completed ?w)
  )
)

; problem
(define (problem make-wreath)
  (:domain wreath-making)
  (:objects
    hanger-1 - hanger
    pliers-1 - pliers
    paper1 - paper_square
    paper2 - paper_square
    paper3 - paper_square
    wreath-1 - wreath
    table-1 - table
  )

  (:init
    ;;
    (shape-straight hanger-1)                ;
  )

  (:goal
    ;;
    (and
      (completed wreath-1)
    )
  )
)

; plan
1. (untwist-and-shape-hanger hanger-1 pliers-1)
   deleted: (shape-straight hanger-1)
   added: (shape-circle hanger-1)
   goals met: 0 of 1
2. (crumple-and-thread-paper paper3 hanger-1)
   added: (crumpled paper3) (threaded hanger-1 paper3)
   goals met: 0 of 1
3. (crumple-and-thread-paper paper2 hanger-1)
   added: (crumpled paper2) (threaded hanger-1 paper2)
   goals met: 0 of 1
4. (crumple-and-thread-paper paper1 hanger-1)
   added: (crumpled paper1) (threaded hanger-1 paper1)
   goals met: 0 of 1
5. (push-squares-and-twist-ends hanger-1 pliers-1)
   added: (squares-pushed-away hanger-1) (twisted-ends hanger-1)
   goals met: 0 of 1
6. (slide-and-scrunch-squares paper3 hanger-1)
   added: (squares-scrunched paper3)
   goals met: 0 of 1
7. (slide-and-scrunch-squares paper2 hanger-1)
   added: (squares-scrunched paper2)
   goals met: 0 of 1
8. (slide-and-scrunch-squares paper1 hanger-1)
   added: (squares-scrunched paper1)
   goals met: 0 of 1
9. (finish-wreath wreath-1 hanger-1)
   added: (completed wreath-1)
   goals met: 1 of 1
